---
kind: property
id: P:Autodesk.Revit.DB.StructuralAsset.Name
source: html/688282fa-1881-94b6-3ea2-3e7d1a0dfb74.htm
---
# Autodesk.Revit.DB.StructuralAsset.Name Property

The name of the structural asset.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null